Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled.WebFillet
Web Fillet - fillet radius between web and flange.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled.WebThicknessLocation
Web Thickness Location.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled.WebThickness
Web Thickness.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled.FlangeThicknessLocation
Flange Thickness Location.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled.FlangeThickness
Flange Thickness.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
Defines parameters for hot rolled structural sections.
Since:
2015